import 'package:arowdi_app/comp/color.dart';
import 'package:arowdi_app/comp/text.dart';
import 'package:arowdi_app/screen/details/button_details.dart';
import 'package:flutter/material.dart';

import 'about.dart';
class details extends StatelessWidget {
  const details({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: black_color,
      body:  SingleChildScrollView(
        scrollDirection: Axis.vertical,
        child: Container(
          alignment: Alignment.center,
          margin: EdgeInsets.all(10),
    child: Column(
    children: [
        SizedBox(height: 50,),
        orange_text(text: "عن التطبيق"),
        SizedBox(height: 20,),
         button_details(
          title: "عن التطبيق",
          details :''' \n  تطبيق العروضي , وهو محرك عروضي يعنى باكتشاف الأوزان الشعرية للأبيات عن طريق استقبالها والبحث في الأبحر الشعرية وزحافاتها وعللها من أجل إيجادها.
        التطبيق من تطوير :\n
          محمد عبيدة فرحات \n
           Twitter : @alfaresof\n
           سليم المسعود

           للإبلاغ عن المشاكل تواصل معنا عبر تويتر'''
         ),
        SizedBox(height: 10,),
        button_details(
            title: "ما هو العروض ؟",
            details :''' 
            علم العَروض هو علم يعرف به صحيح أوزان الشعر العربي من فاسدها وما يعتريها من الزحافات والعلل. هو ميزان الشعر، به يعرف مكسوره من موزونه، كما أن النحو معيار الكلام به يعرف معربه من ملحونه. ويرجع الفضل في إنشائه إلى العالم الخليل بن أحمد الفراهيدي البصري الأزدي والذي كان إمامًا في علوم العربية، وأنه هو الذي استنبط علم العروض وأخرجه إلى الوجود وحصر أقسامه في خمس دوائر يستخرج منها خمسة عشر بحرًا، ثم زاد الأخفش بحرًا واحدًا وسماه الخبب. و ويعرف علم العروض بأنه علم بمعرفة أوزان الشعر العربي، أو هو علم أوزان الشعر الموافق لأشعار العرب، التي اشتهرت عنهم وصحت بالرواية من الطرق الموثوق بها، وبهذا العلم يعرف المستقيم والمنكسر من أشعار العرب والصحيح من السقيم، والمعتل من السليم.
            \n
            للإستزادة ننصحك بمتابعة دروس الدكتور محمد العمري ومتابعة منصته "لسان مبين" على الرابط التالي:
            \n
            https://lm.edu.sa/
            '''

        ),
        SizedBox(height: 10,),
        button_details(
            title: "دليل الإستخدام",
            details :''' 
            سنشرح ببساطة الأمور التي يجب مراعاتها أثناء إدخالك للبيت الشعر وذلك تلافياً للأخطاء.
            \n
            -سيظهر لك فوق مساحة إدخال البيت الكتابة العروضية للبيت و الكتابة بالساكن والمتحرك , تأكد من ادخالك للحركات بشكل صحيح قبل الضغط على زر البحث
            \n
              -تحتاج إلى تشكيل الاحرف المتحركة التي لا تبدأ الكلمة بها ولا تسبق المد , وفي حالة تركت الحرف لوحده سيعتبر ساكناً.
            \n
             -راعِ التشكيل في المدود والتنوين , أيضاً يتطلب التشكيل على الهمزات "أ , ؤ , ئ"  
            \n
              -في حالة كنت متأكداً من التشكيل , ولم يجد البيت أو واجهت أي مشكلة توجه إلى حساب المطور على تويتر وأبلغ عن المشكلة:
            \n
              @alfaresof
            \n
             او عن طريق الإيميل :
            \n
            alfaresof@gmail.com
            '''

        ),
    ],
    ),


    ),
      ));
  }
}

